#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

////1
////输出什么？
//#include <stdio.h>
//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}
////-1 -1 255


////2
//#include <stdio.h>
//int main()
//{
//	char a = -128;
//	printf("%u\n", a);
//	return 0;
//}
////1000 0000 0000 0000 0000 0000 1000 0000 原码
////1111 1111 1111 1111 1111 1111 1000 0000 补码


////3
//int main()
//{
//	char a = 128;
//	printf("%u\n", a);
//	return 0;
//}
////%u打印十进制无符号数字
////1000 0000 0000 0000 0000 0000 1000 0000 原反补码相同


////4
//int main()
//{
//	int i = -20;
//	unsigned  int  j = 10;
//	printf("%d\n", i + j);
//
//	return 0;
//}
//
////按照补码的形式进行运算，最后格式化成为有符号整数
//
////10000000 00000000 00000000 000010100
////11111111 11111111 11111111 111101100 i补码
////00000000 00000000 00000000 000001010 j补码
////11111111 11111111 11111111 111110110 相加
////10000000 00000000 00000000 000001010 最终结果的原码 -10


////5
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}
////死循环，因为unsigned int 变量始终大于等于0，循环条件恒成立


////6
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i<1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}
//
//// char a[-1,-2,-3,-4  ....... -127,-128,127,126,......3,2,1,0]
////strlen   求'\0'之前的字符串长度
////所以结果为255  (不是256，因为不算'\0')


//7
unsigned char i = 0;
int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("hello world\n");
	}
	return 0;
}
//死循环，无符号char的范围0-255,循环条件恒成立
