#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

int main()
{
	int n = 9;
	float *pFloat = (float *)&n;
	printf("n的值为：%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);
	//9
	//00000000 00000000 00000000 00001001
	//9.0
	//1001.0
	//1.001 2^3
	//0 10000010 00100000000000000000000 (9.0浮点数的表示)
	//0 00000000 00000000000000000001001(实际此时二进制的表示对应的浮点数）
	//(-1)^0*0.00000000000000000001001*2^-126
	// 所以此数是一个接近于0的很小的一个数字

	*pFloat = 9.0;
	//0100 0001 0001 0000 0000 0000 0000 0000 
	//0x41100000
	//1091567616
	printf("num的值为：%d\n", n);
	
	printf("*pFloat的值为：%f\n", *pFloat);
	return 0;
}

